# За даден период от време, всеки ден в болницата пристигат пациенти за преглед. Тя разполага първоначално със 7 лекари.
# Всеки лекар може да преглежда само по един пациент на ден, но понякога има недостиг на лекари, затова останалите пациенти се изпращат в други болници.
# Всеки трети ден, болницата прави изчисления и ако броят на непрегледаните пациенти е по-голям от броя на прегледаните, се назначава още един лекар.
# Като назначаването става преди да започне приемът на пациенти за деня.
# Напишете програма, която изчислява за дадения период броя на прегледаните и непрегледаните пациенти.
doctors = 7
pat_helped = 0
pat_not_helped = 0
strike = 0
all_pat = 0
days = int(input())
for uwu in range(days):
    if pat_not_helped > pat_helped:
        strike += 1
        if strike == 3:
            doctors += 1
            strike = 0
    new_pat = int(input())
    pat_helped += doctors
    pat_not_helped += abs(new_pat - pat_helped)

print(f"Treated patients: {pat_helped}.")
print(f"Untreated patients: {pat_not_helped}.")