# Задача 4. Компютърна фирма
# Фирма за компютри е наела Вас, за да изчислите възможните продажби. Да се напише програма, която за
# определен вид компютри пресмята средния рейтинг и направените продажби.


# Вход
# От конзолата се прочита:
# На първия ред:
# Първо се въвежда едно число от конзолата, което представлява броя на моделите компютри.
# • n - брой компютри - цяло число в интервала [1…10]
rat_model = 0
possible_sales = 0
actual_sales = 0
total_sales = 0
computer_count_n = int(input())
# На следващите n реда:
# След това последователно за всеки от моделите компютри се въвежда по едно число:
for pc in range(computer_count_n):
# • Числото, представляващо възможните продажби и рейтинга - цяло число в интервала [32…306]
    identify_number_text = input()
# • Последната цифра (единиците) на това число представлява рейтингът, който е в интервала [2…6].
    rating = int(identify_number_text[2])
# • Останалите цифри (стотици и десетици) са възможните продажби, които ще се осъществят.
    possible_sales = int(identify_number_text[:2])


# Компютърната продажба се скалира на база рейтинг:
# • Рейтинг 2 взима 0% от възможните продажби.
    if rating == 2:
        actual_sales = 0.00 * possible_sales
        rat_model +=2
# • Рейтинг 3 взима 50% от възможните продажби.
    elif rating == 3:
        actual_sales = 0.50 * possible_sales
        total_sales += actual_sales
        rat_model += 3
    # • Рейтинг 4 взима 70% от възможните продажби.
    elif rating == 4:
        actual_sales = 0.70 * possible_sales
        total_sales += actual_sales
        rat_model += 4
# • Рейтинг 5 взима 85% от възможните продажби.
    elif rating == 5:
        actual_sales = 0.85 * possible_sales
        total_sales += actual_sales
        rat_model += 5
# • Рейтинг 6 взима 100% от възможните продажби.
    elif rating == 6:
        actual_sales = possible_sales
        total_sales += actual_sales
        rat_model += 6
av_rating = rat_model / computer_count_n

print(f'{total_sales:.2f}')
print(f'{av_rating:.2f}')

# Изход
# На конзолата се отпечатват 2 редa:
# • Броят направени продажби
# • Средноаритметичният рейтинг за всички компютри
# Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.