# Задача 5. Разпродажба на екскурзии
# Туристическа фирма разпродава финални екскурзионни пакети за края на годината. Напишете програма,
# която да изчислява, печалбата от разпродажбата и дали са продадени всички пакети или не, като знаете
# първоначалния брой екскурзии и техните цени. Фирмата предлага два вида екскурзии – море ("sea") на
# цена 680 лева и планина ("mountain") на цена 499 лева. При избор на даден пакет, към общата сума се
# добавя съответната цена. При избор на пакет, който вече не е наличен (броят му е равен на 0), не трябва да
# се добавя към общата цена.
profit = 0
# Вход:
# От конзолата първоначално се четат 2 реда:
# 1. Брой екскурзии за море – цяло число в интервала [1… 500]
sea_ex_count = int(input())
# 2. Брой екскурзии за планина – цяло число в интервала [1… 500]
mount_ex_count = int(input())
# След това се чете по един ред до получаване на команда "Stop" или докато фирмата не продаде всички
# пакети:
#  Име на пакет – текст с възможности "sea" или "mountain"

command = input() # sea, mountain, stop
while command != 'Stop' and (sea_ex_count > 0 or mount_ex_count > 0):
    if command == 'sea':
        if sea_ex_count == 0:
            continue
        elif sea_ex_count > 0:
            profit += 680
            sea_ex_count -= 1



    elif command == 'mountain':
        if mount_ex_count == 0:
            continue
        elif mount_ex_count > 0:
            profit += 499
            mount_ex_count -= 1

    command = input()

print(profit)
# Изход:
# На конзолата се отпечатват 1 или 2 реда, според случая:
#  Ако фирмата е успяла да продаде всички пакети:
if (sea_ex_count == 0) and (mount_ex_count == 0):
    print(" Good job! Everything is sold.")
    print(f"Profit: {profit} leva.")
# Винаги се отпечатва:
else:
    print(f"Profit: {profit} leva.")
# "Profit: {печалба от продажбите} leva."
