# Задача 1. PC Store
# Иван искал да си купи няколко части за неговия компютър и отишъл в магазин. Понеже там нямало частите в
# наличност, те трябвало да ги поръчат. Той искал да си купи процесор, видео карта и RAM памет, като за
# процесора и видео картата магазинът му прави няколко процента отстъпка. Всичко трябвало да плати в
# долари, затова трябва цените да се обърнат в лева, като приемем, че 1 долар = 1.57 лева.
# Да се напише програма, която пресмята колко общо пари ще му трябват в лева, за да може да си закупи
# частите.
# Вход
# От конзолата се прочитат 5 реда:
# • На първи ред: цената в долари за процесора – реално число в интервала [200.00 … 3000.00]
cpu_price_dollar = float(input())
# • На втори ред: цената в долари за видео карта – реално число в интервала [100.00 … 1500.00]
vid_price_dollar = float(input())
# • На трети ред: цената в долари за една RAM памет – реално число в интервала [80.00 ... 500.00]
ram_price_dollar = float(input())
# • На четвърти: ред брой RAM памети – цяло число в интервала [1 ... 4]
ram_count = int(input())
# • На пети ред: процент отстъпка – реално число в интервала [0.01 … 0.1]
discount = float(input())

cpu_price_lv = cpu_price_dollar * 1.57
vid_price_lv = vid_price_dollar * 1.57

cpu_price_discounted = cpu_price_lv - (cpu_price_lv * discount)
vid_price_discounted = vid_price_lv - (vid_price_lv * discount)

ram_price_lv = ram_price_dollar * 1.57
ram_price_multiplied = ram_price_lv * ram_count

total_price_in_lv = cpu_price_discounted + vid_price_discounted + ram_price_multiplied
print(f"Money needed - {total_price_in_lv:.2f} leva.")
# Изход
# Да се отпечата на конзолата на един ред:
# • Колко общо лева ще му трябват, за да си закупи частите.
#  "Money needed - {общо лева} leva."
# Сумата трябва да се форматира до втория знак след десетичната запетая.