# Задача 6. Уникални PIN кодове
# Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в
# определен интервал. За да бъде валиден един PIN код той трябва да отговаря на следните условия:
# • Първата и третата цифра трябва да бъдат четни
# • Втората цифра трябва да бъде просто число в диапазона [2...7]
# Вход:
# От конзолата се четат 3 реда:
# • Горната граница на първото число - цяло число в диапазона [1...9]
x1_max_value = int(input())
# • Горната граница на второто число - цяло число в диапазона [1...9]
x2_max_value = int(input())
# • Горната граница на третото число - цяло число в диапазона [1...9]
x3_max_value = int(input())

prime_nums_allowed = 2, 3, 5, 7

for x1 in range(2,x1_max_value +1):
    for x2 in range(2, x2_max_value + 1):
        for x3 in range(2, x3_max_value + 1):
            if (x1 % 2 == 0) and (x2 in prime_nums_allowed) and (x3 % 2 == 0):
                print(f'{x1} {x2} {x3}')
# Изход:
# Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните
# интервали.